Revit 2027 API
BendingDetailCustomFieldProperties.AngularDimensionsOffset Property
 Identifies the offset of the angular dimensions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AngularDimensionsOffset { get; set; }
Public Property AngularDimensionsOffset As Double
	Get
	Set
public:
property double AngularDimensionsOffset {
	double get ();
	void set (double value);
}
member AngularDimensionsOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for angularDimensionsOffset must be between 0 and 30000 feet.
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace